src/InformationRegisters/ИнцидентыДлительность/ИнцидентыДлительность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнцидентыДлительность</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Открыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИнцидентыДлительность/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ОткрытьДлительностьИнцидента(Инцидент, ТипИнцидента, УровеньИнцидента, Ответственный) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДата();
    
    ВыборкаОткрытых = ПолучитьВыборкуОткрытых(Инцидент);
    
    УровеньИнцидентаОткрыть = Истина;
    Пока ВыборкаОткрытых.Следующий() Цикл
        Если ВыборкаОткрытых.УровеньИнцидента <> УровеньИнцидента ИЛИ ВыборкаОткрытых.Ответственный <> Ответственный Тогда
            
            МенеджерЗаписи = РегистрыСведений.ИнцидентыДлительность.СоздатьМенеджерЗаписи();
            МенеджерЗаписи.Период = ВыборкаОткрытых.Период;
            МенеджерЗаписи.Инцидент = Инцидент;
            МенеджерЗаписи.Открыт = Истина;
            МенеджерЗаписи.Прочитать();
            
            МенеджерЗаписи.Открыт = Ложь;
            МенеджерЗаписи.Длительность = ТекДата - МенеджерЗаписи.Период;
            МенеджерЗаписи.Записать(Истина);
        Иначе
            УровеньИнцидентаОткрыть = Ложь;    
        КонецЕсли;
    КонецЦикла;
    
    Если УровеньИнцидентаОткрыть Тогда
        МенеджерЗаписи = РегистрыСведений.ИнцидентыДлительность.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Период = ТекДата;
        МенеджерЗаписи.Инцидент = Инцидент;
        МенеджерЗаписи.Открыт = Истина;
        МенеджерЗаписи.ТипИнцидента = ТипИнцидента;
        МенеджерЗаписи.УровеньИнцидента = УровеньИнцидента;
        МенеджерЗаписи.Ответственный = Ответственный;
        МенеджерЗаписи.Длительность = 0;
        МенеджерЗаписи.Записать(Ложь);
    КонецЕсли;
            
КонецПроцедуры

Процедура ЗакрытьДлительностьИнцидента(Инцидент) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДата();
    
    ВыборкаОткрытых = ПолучитьВыборкуОткрытых(Инцидент);
    
    Пока ВыборкаОткрытых.Следующий() Цикл
        МенеджерЗаписи = РегистрыСведений.ИнцидентыДлительность.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Период = ВыборкаОткрытых.Период;
        МенеджерЗаписи.Инцидент = Инцидент;
        МенеджерЗаписи.Открыт = Истина;
        МенеджерЗаписи.Прочитать();
        
        МенеджерЗаписи.Открыт = Ложь;
        МенеджерЗаписи.Длительность = ТекДата - МенеджерЗаписи.Период;
        МенеджерЗаписи.Записать(Истина);
     КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВыборкуОткрытых(Инцидент)
    
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   Период,
    |   УровеньИнцидента,
    |   Ответственный
    |ИЗ
    |   РегистрСведений.ИнцидентыДлительность
    |ГДЕ
    |   Инцидент = &Инцидент
    |   И Открыт = Истина
    |";
    
    Запрос.УстановитьПараметр("Инцидент", Инцидент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Возврат Выборка;
    
КонецФункции

#КонецОбласти

#КонецЕсли
